---
kind: method
id: M:Autodesk.Revit.DB.CitySet.#ctor
source: html/8d5be629-45f6-89d3-b82b-a41ff7204ee0.htm
---
# Autodesk.Revit.DB.CitySet.#ctor Method

Initializes a new instance of the CitySet class

## Syntax (C#)
```csharp
public CitySet()
```